#pragma once
#include <cstdint>
#include "packet_def.h"
#include "defines.h"
#include "tables.h"
#include "constants.h"
#include "item_data.h"

// Common
// =========================================================================================================================
enum ECommonHeaders
{
	HEADER_KEY_AGREEMENT	= 254,
	HEADER_HANDSHAKE		= 255
};
// =========================================================================================================================

// CG
// =========================================================================================================================
enum EClientToGameHeaders : TPacketHeader
{
	HEADER_CG_LOGIN = 1,
	HEADER_CG_ATTACK = 2,
	HEADER_CG_CHAT = 3,
	HEADER_CG_PLAYER_CREATE = 4,
	HEADER_CG_PLAYER_DESTROY = 5,
	HEADER_CG_PLAYER_SELECT = 6,
	HEADER_CG_CHARACTER_MOVE = 7,
	HEADER_CG_SYNC_POSITION = 8,
	HEADER_CG_ENTERGAME = 9,
	HEADER_CG_ITEM_USE = 10,

	HEADER_CG_ITEM_DROP = 11,
	HEADER_CG_ITEM_MOVE = 12,
	HEADER_CG_ITEM_PICKUP = 13,
	HEADER_CG_QUICKSLOT_ADD = 14,
	HEADER_CG_QUICKSLOT_DEL = 15,
	HEADER_CG_QUICKSLOT_SWAP = 16,
	HEADER_CG_WHISPER = 17,
	HEADER_CG_ITEM_DROP2 = 18,
	HEADER_CG_ON_CLICK = 19,
	HEADER_CG_EXCHANGE = 20,

	HEADER_CG_CHARACTER_POSITION = 21,
	HEADER_CG_SCRIPT_ANSWER = 22,
	HEADER_CG_QUEST_INPUT_STRING = 23,
	HEADER_CG_QUEST_CONFIRM = 24,
	HEADER_CG_SHOP = 25,
	HEADER_CG_FLY_TARGETING = 26,
	HEADER_CG_USE_SKILL = 27,
	HEADER_CG_ADD_FLY_TARGETING = 28,
	HEADER_CG_SHOOT = 29,

	GUILD_SUBHEADER_GC_CHANGE_MEMBER_GENERAL,
	GUILD_SUBHEADER_GC_GUILD_INVITE,
	GUILD_SUBHEADER_GC_WAR,
	GUILD_SUBHEADER_GC_GUILD_NAME,
	GUILD_SUBHEADER_GC_GUILD_WAR_LIST,
	GUILD_SUBHEADER_GC_GUILD_WAR_END_LIST,
	GUILD_SUBHEADER_GC_WAR_SCORE,
	GUILD_SUBHEADER_GC_MONEY_CHANGE,
};

enum EPacketGGGuildSubHeaderType
{
	GUILD_SUBHEADER_GG_CHAT,
	GUILD_SUBHEADER_GG_SET_MEMBER_COUNT_BONUS,
};

enum EPacketCGMessengerSubHeaderType
{
	MESSENGER_SUBHEADER_CG_ADD_BY_VID,
	MESSENGER_SUBHEADER_CG_ADD_BY_NAME,
	MESSENGER_SUBHEADER_CG_REMOVE
};

enum EPacketGCMessengerSubHeaderType
{
	MESSENGER_SUBHEADER_GC_LIST,
	MESSENGER_SUBHEADER_GC_LOGIN,
	MESSENGER_SUBHEADER_GC_LOGOUT,
	MESSENGER_SUBHEADER_GC_INVITE
};

enum EPacketCGShopSubHeaderType
{
	SHOP_SUBHEADER_CG_END,
	SHOP_SUBHEADER_CG_BUY,
	SHOP_SUBHEADER_CG_SELL,
	SHOP_SUBHEADER_CG_SELL2
};

enum EPacketGCShopSubHeaderType
{
	SHOP_SUBHEADER_GC_START,
	SHOP_SUBHEADER_GC_END,
	SHOP_SUBHEADER_GC_UPDATE_ITEM,
	SHOP_SUBHEADER_GC_UPDATE_PRICE,
	SHOP_SUBHEADER_GC_OK,
	SHOP_SUBHEADER_GC_NOT_ENOUGH_MONEY,
	SHOP_SUBHEADER_GC_INVENTORY_FULL,
	SHOP_SUBHEADER_GC_INVALID_POS,
	SHOP_SUBHEADER_GC_SOLD_OUT,
	SHOP_SUBHEADER_GC_START_EX,
	SHOP_SUBHEADER_GC_NOT_ENOUGH_MONEY_EX,
};

enum EPacketCGExchangeSubHeaderType
{
	EXCHANGE_SUBHEADER_CG_START,			// arg1 == vid of target character
	EXCHANGE_SUBHEADER_CG_ITEM_ADD,		// arg1 == position of item
	EXCHANGE_SUBHEADER_CG_ITEM_DEL,		// arg1 == position of item
	EXCHANGE_SUBHEADER_CG_ELK_ADD,			// arg1 == amount of elk
	EXCHANGE_SUBHEADER_CG_ACCEPT,			// arg1 == not used
	EXCHANGE_SUBHEADER_CG_CANCEL,			// arg1 == not used
};

enum EPacketGCExchangeSubHeaderType
{
	EXCHANGE_SUBHEADER_GC_START,			// arg1 == vid
	EXCHANGE_SUBHEADER_GC_ITEM_ADD,		// arg1 == vnum  arg2 == pos  arg3 == count
	EXCHANGE_SUBHEADER_GC_ITEM_DEL,		// arg1 == pos
	EXCHANGE_SUBHEADER_GC_ELK_ADD,			// arg1 == elk
	EXCHANGE_SUBHEADER_GC_ACCEPT,			// arg1 == accept
	EXCHANGE_SUBHEADER_GC_END,				// arg1 == not used
	EXCHANGE_SUBHEADER_GC_ALREADY,			// arg1 == not used
	EXCHANGE_SUBHEADER_GC_LESS_ELK,		// arg1 == not used
};

enum EPacketGCFishingSubHeaderType
{
	FISHING_SUBHEADER_GC_START,
	FISHING_SUBHEADER_GC_STOP,
	FISHING_SUBHEADER_GC_REACT,
	FISHING_SUBHEADER_GC_SUCCESS,
	FISHING_SUBHEADER_GC_FAIL,
	FISHING_SUBHEADER_GC_FISH,
};

enum EPacketCGAcceSubHeaderType
{
	ACCE_SUBHEADER_CG_CLOSE,
	ACCE_SUBHEADER_CG_ADD,
	ACCE_SUBHEADER_CG_REMOVE,
	ACCE_SUBHEADER_CG_REFINE
};

enum EPacketGCAcceSubHeaderType
{
	ACCE_SUBHEADER_GC_OPEN,
	ACCE_SUBHEADER_GC_CLOSE,
	ACCE_SUBHEADER_GC_ADDED,
	ACCE_SUBHEADER_GC_REMOVED,
	ACCE_SUBHEADER_GC_REFINED
};

enum EPacketGCDungeonSubHeaderType
{
	DUNGEON_SUBHEADER_GC_TIME_ATTACK_START,
	DUNGEON_SUBHEADER_GC_DESTINATION_POSITION
};

// =========================================================================================================================


#pragma pack(push)
#pragma pack(1)

// Common
// =========================================================================================================================
struct SDynamicSizePacketHeader
{
	uint8_t	 header{};
	uint16_t size{};
};

struct SPacketSyncPositionElement
{
	uint32_t dwVID{};
	int32_t	 lX{};
	int32_t	 lY{};
};
// =========================================================================================================================

// Client To Game
// =========================================================================================================================

// Size calculation:
//	Header size(sizeof(TPacketHeader)) (default: 1)
//  Struct elements size
// Example:
//	NET_DECLARE_PACKET(42, { char x[12]; uint32_t y; });
//	sizeof(TPacketHeader) + /* sizeof(this->x) */ + /* sizeof(this->y) */
//	1					  +    12                 + 4                  = 17 
//	sizeof(packet) /* 17 */ should be equal to 17

struct SPacketCGLogin : SNetPacket
{
	char login[LOGIN_MAX_LEN + 1]{};
	char passwd[PASSWD_MAX_LEN + 1]{};

	NET_DECLARE_PACKET(HEADER_CG_LOGIN, SPacketCGLogin); // 1
};
static_assert((sizeof(SPacketCGLogin)) == (sizeof(TPacketHeader) + LOGIN_MAX_LEN + 1 + PASSWD_MAX_LEN + 1));
static_assert(sizeof(SPacketCGLogin) == 49);

struct SPacketCGAttack : SNetPacket
{
	uint8_t		bType{};
	uint32_t	dwVictimVID{};

	NET_DECLARE_PACKET(HEADER_CG_ATTACK, SPacketCGAttack); // 2
};
static_assert((sizeof(SPacketCGAttack)) == (sizeof(TPacketHeader) + (sizeof(uint8_t) + sizeof(uint32_t))));
static_assert(sizeof(SPacketCGAttack) == 6);

struct SPacketCGChat : SNetPacket
{
	uint16_t length{};
	uint8_t	 type{};

	NET_DECLARE_PACKET(HEADER_CG_CHAT, SPacketCGChat); // 3
};
static_assert((sizeof(SPacketCGChat)) == (sizeof(TPacketHeader) + (sizeof(uint16_t) + sizeof(uint8_t))));
static_assert(sizeof(SPacketCGChat) == 4);

struct SPacketCGCreateCharacter : SNetPacket
{
	uint8_t     index{};
	char        name[CHARACTER_NAME_MAX_LEN + 1]{};
	uint16_t    job{};
	uint8_t		shape{};
	uint8_t		CON{};
	uint8_t		IQ{};
	uint8_t		STR{};
	uint8_t		DEX{};

	NET_DECLARE_PACKET(HEADER_CG_PLAYER_CREATE, SPacketCGCreateCharacter); // 4
};
static_assert((sizeof(SPacketCGCreateCharacter)) == (sizeof(TPacketHeader) + (sizeof(uint8_t) + CHARACTER_NAME_MAX_LEN + 1 + sizeof(uint16_t) + sizeof(uint8_t) + sizeof(uint8_t) + sizeof(uint8_t) + sizeof(uint8_t) + sizeof(uint8_t))));
static_assert(sizeof(SPacketCGCreateCharacter) == 34);

struct SPacketCGDestroyCharacter : SNetPacket
{
	uint8_t index{};
	char	szPrivateCode[PRIVATE_CODE_LENGTH]{};

	NET_DECLARE_PACKET(HEADER_CG_PLAYER_DESTROY, SPacketCGDestroyCharacter); // 5
};
static_assert((sizeof(SPacketCGDestroyCharacter)) == (sizeof(TPacketHeader) + sizeof(uint8_t) + PRIVATE_CODE_LENGTH));
static_assert(sizeof(SPacketCGDestroyCharacter) == 10);

struct SPacketCGSelectCharacter : SNetPacket
{
	uint8_t	player_index{};

	NET_DECLARE_PACKET(HEADER_CG_PLAYER_SELECT, SPacketCGSelectCharacter); // 6
};
static_assert((sizeof(SPacketCGSelectCharacter)) == (sizeof(TPacketHeader) + sizeof(uint8_t)));
static_assert(sizeof(SPacketCGSelectCharacter) == 2);

struct SPacketCGMove : SNetPacket
{
	uint8_t		bFunc{};
	uint8_t		bArg{};
	float		rot{};
	int32_t		lX{};
	int32_t		lY{};
	uint32_t	dwTime{};

	NET_DECLARE_PACKET(HEADER_CG_CHARACTER_MOVE, SPacketCGMove); // 7
};

struct SPacketCGSyncPosition : SNetPacket
{
	uint16_t wSize{};

	NET_DECLARE_PACKET(HEADER_CG_SYNC_POSITION, SPacketCGSyncPosition); // 8
};

struct SPacketCGEnterFrontGame : SNetPacket
{
	NET_DECLARE_PACKET(HEADER_CG_ENTERGAME, SPacketCGEnterFrontGame); // 9
};

struct SPacketCGItemUse : SNetPacket
{
	TItemPos pos{};

	NET_DECLARE_PACKET(HEADER_CG_ITEM_USE, SPacketCGItemUse); // 10
};

struct SPacketCGItemDrop : SNetPacket
{
	TItemPos pos{};
	uint32_t elk{};

	NET_DECLARE_PACKET(HEADER_CG_ITEM_DROP, SPacketCGItemDrop); // 11
};

struct SPacketCGItemMove : SNetPacket
{
	TItemPos pos{};
	TItemPos change_pos{};
	uint8_t  num{};

	NET_DECLARE_PACKET(HEADER_CG_ITEM_MOVE, SPacketCGItemMove); // 12
};

